Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at http://rt.perl.org/perlbug/ . There may also be information at http://www.perl.org/ , the Perl Home Page.
es_es: Si encuentra algo que piensa que es un error, podría verificar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y la base de datos de errores de perl en http://rt.perl.org/bugs . Hay también información en la página principal de Perl, http://www.perl.org/ .

source: The above recipes describe the ordering of matches I<at a given position>.
es_es: Las recetas anteriores describen el orden de las coincidencias I<en una determinada posición>.

source: To pass a literal dollar-sign through to the shell you need to hide it with a backslash.
es_es: Para pasar un signo de dólar literal al shell, necesita escaparlo con una barra invertida.

source: ### redo always comes here
es_es: ### redo siempre viene aquí

source: It produces a warning if warnings are enabled.
es_es: Genera una advertencia si las advertencias están habilitadas.

source: The bracketing construct C<( ... )> creates capture groups (also referred to as capture buffers).
es_es: La construcción de paréntesis C<( ... )> crea grupos de captura (también referidos como búferes de captura).

source: =item lcfirst EXPR X<lcfirst> X<lowercase>
es_es: =item lcfirst EXPR X<lcfirst> X<lowercase> X<minúscula>

source: In other words, assume nothing about the returned string itself nor about how many bytes of SALT may matter.
es_es: En otras palabras, no asuma nada sobre la cadena devuelta, ni sobre la cantidad de bytes de SALTO pueden importar.

source: Last update: 2008-10-29
es_es: Última actualización: 2008-10-29

source: C<last>, C<next>, or C<redo> may appear within a C<continue> block; C<last> and C<redo> behave as if they had been executed within the main block.
es_es: C<last>, C<next> o C<redo> puede aparecer dentro de un bucle C<continue>; C<last> y C<redo> se comportarán como si se hubieran ejecutado dentro del bloque principal.

source: That won't work at all, because C<.*> was greedy and gobbled up the whole string.
es_es: Eso no funciona de ninguna manera, porque C<.*> era codicioso y engulló toda la cadena.

source: Note the I<in bytes>: even if the filehandle has been set to operate on characters (for example by using the C<:encoding(utf8)> I/O layer), tell() will return byte offsets, not character offsets (because implementing that would render sysseek() unacceptably slow).
es_es: Nota sobre lo de I<en bytes>: incluso si el identificador de archivo se ha puesto para operar en caracteres (por ejemplo usando la capa de E/S C<:encoding(utf8)>), tell() devolverá desplazamientos en bytes, no en caracteres (porque implementando esto convertirían en inaceptablemente lentas a seek() y tell()).

source: You might also try C<perldoc perl> in case your system doesn't have a proper C<man> command, or it's been misinstalled.
es_es: Si su sistema no ofrece un comando C<man>, o se ha desinstalado, también puede usar C<perldoc perl>.

source: However, there is a clever way of making your one-line conditional blocks more English like:
es_es: Sin embargo, puede escribir los bloques condicionales de una sola línea de manera que recuerden a una frase en inglés:

source: use 5.6.1; # ditto
es_es: use 5.6.1; # ídem

source: Math::FixedPrecision calculate with a fixed precision
es_es: Math::FixedPrecision calcula con una precisión fija

source: @eldest = sort { $age{$b} <=> $age{$a} } keys %age;
es_es: @eldest = sort { $edad{$b} <=> $edad{$a} } keys %edad;

source: TIEARRAY classname, LIST
es_es: TIEARRAY clase, LISTA

source: CPAN indicates the base directory of a CPAN mirror, and the rest of the path is the path from that directory to the file.
es_es: CPAN indica el directorio raíz de un servidor reflejado de CPAN, y el resto de la ruta de acceso es la ruta desde ese directorio al archivo.

source: It claims that there is no 123 in the string.
es_es: Afirma que no hay un 123 en la cadena.

source: Returns true if it succeeded, false otherwise.
es_es: Devuelve verdadero si tiene éxito; de lo contrario, falso.

source: $re =~ s{ \\ ( \\ | Y . ) } { $rules{$1} or invalid($re,$1) }sgex;
es_es: $re =~ s{ \\ ( \\ | Y . ) } { $reglas{$1} or invalido($re,$1) }sgex;

source: "sendfile" will have internal linkage.
es_es: "sendfile" tendrá un enlazado interno.

source: See also C<keys>, C<each>, and C<sort>.
es_es: Ver también C<keys>, C<each> y C<sort>.

source: Use only on a scalar value, an array (using C<@>), a hash (using C<%>), a subroutine (using C<&>), or a typeglob (using C<*>).
es_es: Use solamente sobre un valor escalar, un array (usando C<@>), un hash (con C<%>), una subrutina (con C<&>), o un typeglob (usando C<*>).

source: So rewriting this way produces what you'd expect; that is, case 5 will fail, but case 6 succeeds:
es_es: Así que volviéndolo a escribir de esta manera produce lo que se espera, es decir, el caso 5 fallará, pero el caso 6 tendrá éxito:

source: If you really want to continue using the C<$*>-variable but not to see the deprecation warnings, use:
es_es: Si realmente desea seguir utilizando la variable C<$*> pero no quiere ver la advertencia de obsolescencia, utilice:

source: C<overload> upgraded to version 1.04
es_es: C<overload> actualizado a la versión 1.04

source: print "Files: ";
es_es: print "Archivos: ";

source: $a -= 1; # same as $a = $a - 1
es_es: $a -= 1; # igual que $a = $a - 1

source: This is something like adding a row at a time.
es_es: Esto es algo así como la adición de una fila cada vez.

source: As in some shells, you can enclose the variable name in braces to disambiguate it from following alphanumerics (and underscores).
es_es: Al igual que en algunos entornos de líneas de comandos, puede encerrar el nombre de la variable entre llaves para eliminar la ambigüedad de los ulteriores caracteres alfanuméricos (y guiones bajos).

source: Let's say you'd like to match a number at the end of a string, and you also want to keep the preceding part of the match.
es_es: Digamos que quisiera buscar la coincidencia con un número al final de una cadena, y también que desea mantener la parte anterior a esa coincidencia.

source: =head2 $AUTOLOAD can now be tainted
es_es: =head2 $AUTOLOAD ahora puede ser contaminada

source: =item sort SUBNAME LIST X<sort> X<qsort> X<quicksort> X<mergesort>
es_es: =item sort NOMBRE_SUB LISTA X<sort> X<qsort> X<quicksort> X<mergesort>

source: The loop control statements don't work in an C<if> or C<unless>, since they aren't loops.
es_es: Las instrucciones de control de bucle no funcionan en un C<if> o C<unless>, porque no son bucles.

source: defined( $_ = <$fh> ) or die "readline failed: $!";
es_es: defined( $_ = <$fh> ) or die "readline falló: $!";

source: line number
es_es: número de línea

source: For example, the following matches:
es_es: Por ejemplo, lo siguiente coincide:

source: The internal structure of the C<ext/> directory in the perl source has been reorganised.
es_es: La estructura interna del directorio C<ext/> en el código fuente de perl, se ha reorganizado.

source: Here is a short, but incomplete summary:
es_es: Aquí hay un breve resumen, aunque incompleto:

source: perlgpl has been added: it is the GNU General Public License in pod format, making it easier for modules to refer to it.
es_es: perlgpl ha sido añadido: es la Licencia General Pública GNU en formato pod, haciendo más fácil para los módulos referirse a ella.

source: =head2 Is it a Perl program or a Perl script?
es_es: =head2 ¿Se debe decir programa Perl o script Perl?

source: And if it's an integer I<n>, the offset is relative to the start of the I<n>th innermost C<( )> group, or to the start of the string if I<n> is bigger then the group level.
es_es: Y si es un número entero I<n>, el desplazamiento es relativo al inicio del I<n>-ésimo grupo C<()> más interno, o al inicio de la cadena si I<n> es más grande que el número de grupos.

source: See L<perlrun> for the C<-M> and C<-m> command-line options to Perl that give C<use> functionality from the command-line.
es_es: Ver L<perlrun> para las opciones en línea de comandos C<-M> y C<-m> para Perl que dan la funcionalidad de C<use> en la línea de comandos.

source: @b = (1,undef)[1,0,2]; # @b has three elements
es_es: @b = (1,undef)[1,0,2]; # @b tiene tres elementos

source: printf "%-12s ", $pat;
es_es: printf "%-12s ", $patron;

source: =item syswrite FILEHANDLE,SCALAR,LENGTH,OFFSET X<syswrite>
es_es: =item syswrite IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD,DESPLAZAMIENTO X<syswrite>

source: $baz = 0+$foo & 0+$bar; # both ops explicitly numeric
es_es: $baz = 0+$foo & 0+$bar; # ambas op. explícitamente numéricas

source: The substitution operator.
es_es: El operador de sustitución.

source: Identical to C<(?PARNO)> except that the parenthesis to recurse to is determined by name.
es_es: Idéntico a C<(?PARNO)> salvo que el paréntesis a re-ejecutar se determina por su nombre.

source: Previously callbacks were only invoked in the C<case $variable $define)> branch.
es_es: Retrollamadas anteriores solo se invocaban en la rama C<case $variable $define)>.

source: All the rest is either converted to literal strings to match, or else is ignored (as is whitespace and C<#>-style comments if C<//x> is present).
es_es: Todo lo demás es o bien convertido en cadenas de literales para ser cotejados, o bien es ignorado (como lo es el espacio en blanco y los comentarios C<#>, si C<//x> está presente).

source: The F<INSTALL> file for how to build Perl.
es_es: El archivo F<INSTALL> (INSTALAR) de cómo construir Perl.

source: It's just F<perlbug> installed under another name.
es_es: No es más que F<perlbug> instalado con otro nombre.

source: As of the 5.8.0 release, sysopen()/sysread()/syswrite() do not behave like they used to in 5.6.1 and earlier with respect to "text" mode.
es_es: A partir de la versión 5.8.0, sysopen()/sysread()/syswrite() no se comportan como lo hacían antes en 5.6.1 y anteriores, con respecto al modo "texto".

source: C<perldoc> has been rewritten from scratch to be more robust and feature rich.
es_es: C<perldoc> ha sido reescrito desde cero para ser más robusto y rico en características.

source: Further investigation is needed to get this working better.
es_es: Será necesaria una investigación adicional para que esto funcione mejor.

source: ($colors{'red'}, $colors{'blue'}, $colors{'green'}) = (0xff0000, 0x0000ff, 0x00ff00);
es_es: ($colores{'rojo'}, $colores{'azul'}, $colores{'verde'}) = (0xff0000, 0x0000ff, 0x00ff00);

source: See also exit(), warn(), and the Carp module.
es_es: Ver también exit(), warn() y el módulo Carp.

source: native integer --> native floating point (*)
es_es: entero nativo --> punto flotante nativo (*)

source: On the other hand:
es_es: De otra forma:

source: That's because both scalars and lists are automatically interpolated into lists.
es_es: Esto es porque ambos tipos, escalares y listas, son automáticamente interpolados en listas.

source: More subtle problem is reliance on the order of "global destruction".
es_es: Un problema más sutil es la confianza en el orden de la "destrucción global".

source: Some of the highlights include:
es_es: Algunos elementos destacados son:

source: Irix 6.3 and later are okay.
es_es: Irix 6.3 y siquientes están bien.

source: eval { die "foo lives here" };
es_es: eval { die "foo vive aquí" };

source: else { # handle all other possible exceptions
es_es: else { # controla todas las otras posibles excepciones

source: =item sub NAME : ATTRS BLOCK
es_es: =item sub NOMBRE : ATRIBS BLOQUE

source: =head3 Return value
es_es: =head3 Valor de retorno

source: File descriptors (and sometimes locks on those descriptors) are shared, while everything else is copied.
es_es: Descriptores de archivo (y algunas veces bloqueos en estos descriptores) son compartidos, mientras que todo lo demás es copiado.

source: =item listen SOCKET,QUEUESIZE X<listen>
es_es: =item listen SOCKET,TAMAÑO_COLA X<listen>

source: Buyer beware.
es_es: Los compradores quedan advertidos.

source: Since this switch could not have been used by anyone, it has been repurposed.
es_es: Dado que esta opción quizás no podría haber sido utilizada más por cualquier persona, se ha reutilizado.

source: Any Object invokes ~~ overloading on $object, or dies
es_es: Cualquiera Objeto invoca ~~ sobrecargado en $objeto, o muere

source: (It doesn't change your current working directory, which is unaffected.) For security reasons, this call is restricted to the superuser.
es_es: (No cambia su actual directorio de trabajo actual, que no queda afectado). Por razones de seguridad, esta llamada está reservada al superusuario.

source: qr{} Pattern yes*
es_es: qr{} Patrón sí*

source: The current leading implementation of Perl 6 is Rakudo ( http://rakudo.org ).
es_es: Actualmente la implementación más avanzada de Perl 6 es Rakudo ( http://rakudo.org ).

source: Thus in the pattern
es_es: Así, en el patrón

source: This implements the C library function of the same name, which on most systems returns the current login from F</etc/utmp>, if any.
es_es: Implementa la función de la biblioteca C del mismo nombre, que en la mayoría de los sistemas devuelve el login actual desde F</etc/utmp>, si existe.

source: Actually, there aren't really functions in this sense, just list operators and unary operators behaving as functions because you put parentheses around the arguments.
es_es: En realidad, no son realmente funciones en ese sentido, solo son operadores de lista y operadores unarios que se comportan como funciones porque usted pone paréntesis a los argumentos.

source: You probably cannot mix C<alarm> and C<sleep> calls, because C<sleep> is often implemented using C<alarm>.
es_es: Es probable que no se pueden mezclar las llamadas C<alarm> y C<sleep>, debido a que C<sleep> a menudo está implementado en C<alarm>.

source: $str remains in UTF-8 format.
es_es: $str sigue estando en formato UTF-8.

source: These hooks are also permitted to set the %INC entry corresponding to the files they have loaded.
es_es: Estos enganches también están autorizados para establecer la entradas %INC correspondientes a los archivos que se hayan cargado.

source: printf '<%10.6x>', 1; # prints "< 000001>"
es_es: printf '<%10.6x>', 1; # imprime "< 000001>"

source: Consistent naming of subroutines or methods
es_es: Denominación consistente de subrutinas o métodos

source: See L</seek> for some details about mixing reading and writing.
es_es: Ver L</seek> para más detalles acerca de mezclar lectura y escritura.

source: Returns a list consisting of all the keys of the named hash, or the indices of an array.
es_es: Devuelve una lista consistente de todas las claves del hash indicado, o los índices de un array.

source: It will print 'A' and then terminate, as it considers the match to be zero-width, and thus will not match at the same position twice in a row.
es_es: Imprimirá 'A' y entonces termina, pues considera la coincidencia de un ancho cero, y por lo tanto no coincidirá en la misma posición dos veces para la misma cadena.

source: With an explicit repeat count for pack, the packed string is adjusted to that length.
es_es: Con un contador de repeticiones explícito para el empaquetado, la cadena de empaquetado se ajusta a esa longitud.

source: perl593delta - what is new for perl v5.9.3
es_es: perl593delta - qué hay de nuevo en perl v5.9.3

source: It is then interpreted as an external command, and the output of that command is the value of the backtick string, like in a shell.
es_es: Entonces es interpretado como un comando externo, y la salida de ese comando es el valor de la cadena entrecomillada, como en un I<shell>.

source: Now that you understand how C<require> looks for files with a bareword argument, there is a little extra functionality going on behind the scenes.
es_es: Ahora que sabe cómo C<require> busca archivos con un argumento simple, hay una funcionalidad extra que pasa por detrás de las cámaras.

source: As I'm sure you have already guessed, this is a problem that DBM Filters can fix very easily.
es_es: Como ya se habrá imaginado, éste es un problema que se puede solucionar fácilmente con filtros DBM.

source: Unary "!" performs logical negation, i.e., "not".
es_es: El unario "!" realiza la negación lógica, es decir, "not".

source: To read your private value, use the macro C<MRO_GET_PRIVATE_DATA()>, passing it the C<mro_meta> structure from the stash, and a pointer to your C<mro_alg> structure:
es_es: Para leer su valor privado, use la macro C<MRO_GET_PRIVATE_DATA()>, pasándole la estructura C<mro_meta> del esquema, y un puntero a la estructura C<mro_alg>:

source: Also, Perl matching doesn't fully conform to the current Unicode C</i> recommendations, which ask that the matching be made upon the NFD (Normalization Form Decomposed) of the text.
es_es: Además, el sistema de coincidencias de Perl no se ajusta plenamente a las recomendaciones actuales de Unicode con C</i>, que piden que la coincidencia se haga en el NFD (I<Normalization Form Decomposed>) del texto.

source: $old_filter = $db->filter_store_value( sub { ... } );
es_es: $filtro_antiguo = $db->filter_store_value( sub { ... } );

source: This allows your code to work with the standard L<crypt|/crypt> and with more exotic implementations.
es_es: Esto permite a su código trabajar con el estándar L<crypt|/crypt> y con implementaciones más exóticas.

source: add the if pragma
es_es: añadido el pragma if

source: One can now have custom character name aliases.
es_es: Ahora puede tener personalizados alias como nombres de caracteres.

source: Math::Pari provides access to the Pari C library
es_es: Math::Pari ofrece acceso a la biblioteca Pari, en C

source: =head2 Tutorials
es_es: =head2 Tutoriales

source: Think of it as a goto with an intervening core dump and reincarnation.
es_es: Piense en él como un goto entre un volcado del núcleo y una reencarnación.

source: # assign a reference to array of array references
es_es: # asignar una referencia a un array de referencias de array

source: This kind of match is called I<smart match>, and it's also possible to use it outside of switch statements, via the new C<~~> operator (enabled via the C<use feature '~~'> directive).
es_es: Este tipo de emparejamientos se llaman I<smart match> (emparejamiento o coincidencia inteligente), y también es posible utilizarlo fuera de las instrucciones switch, a través del nuevo operador C<~~> (activado a través de la directiva C<use feature '~~'>).

source: In that case, you have to open each element of C<@ARGV> yourself since C<eof> handles C<ARGV> differently.
es_es: En este caso, tiene que abrir cada elemento de C<@ARGV> debido a que C<eof> maneja C<ARGV> de otra manera.

source: Returns C<1> on success, false otherwise.
es_es: Devuelve C<1> en caso de éxito; falso en caso contrario.

source: Therefore a decision was made to backtrack the feature and change it from implicit silent default to explicit conscious option.
es_es: Por lo tanto se tomó la decisión de dar marcha atrás a esta característica y se cambió, desde una manera por defecto implícita y silenciosa a otra opción explícita y consciente.

source: If you want to remove the line terminator from your here-docs, use C<chomp()>.
es_es: Si desea quitar el carácter de fin de línea de los documentos incrustados, utilice C<chomp()>.

source: The require function will actually look for the "F<Foo/Bar.pm>" file in the directories specified in the C<@INC> array.
es_es: La función require realmente buscará el archivo "F<Foo/Bar.pm>" en los directorios especificados en el array C<@INC>.

source: You can get an overview of all the files with this command:
es_es: Puede ver una descripción general de todos los archivos con el siguiente comando:

source: perl5141delta Perl changes in version 5.14.1
es_es: perl5141delta Cambios en la versión 5.14.1

source: =item waitpid PID,FLAGS X<waitpid>
es_es: =item waitpid PID,BANDERAS X<waitpid>

source: perlcall Perl calling conventions from C
es_es: perlcall Convenciones de llamada desde C

source: $count = () = $string =~ /\d+/g;
es_es: $cuenta = () = $cadena =~ /\d+/g;

source: SYNOPSIS
es_es: SINOPSIS

source: You can declare a subroutine without defining it by saying C<sub name>, thus: X<subroutine, declaration>
es_es: Puede declarar una subrutina sin definirla diciendo C<sub nombre>, como: X<subrutina, declaración>

source: With non-alphabetical characters, the result is based on the 4 least-significant bits of the input character, i.e., on C<ord($char)%16>.
es_es: Con caracteres no-alfabéticos, el resultado se basa en los 4 bits menos significativos del carácter de entrada, es decir, en C<ord($carácter)%16>.

source: For example, exiting 69 (EX_UNAVAILABLE) from a I<sendmail> incoming-mail filter will cause the mailer to return the item undelivered, but that's not true everywhere.
es_es: Por ejemplo, saliendo con 69 (EX_UNAVAILABLE) desde un filtrado de un correo entrante hacia I<sendmail> hará que el despachador de correo devuelva el elemento sin entregar, pero no siempre es cierto.

source: A new warning, C<$# is no longer supported>, has been added.
es_es: Una nueva advertencia, C<$# is no longer supported>, ha sido añadida.

source: Using uppercase filehandles also improves readability and protects you from conflict with future reserved words.
es_es: Utilizar identificadores de archivo en mayúsculas mejora la legibilidad de los programas y les protege de conflictos con futuras palabras reservadas.

source: =head2 Creating Custom RE Engines
es_es: =head2 Creando motores RE personalizados

source: Now you should be very careful that the outer bracket type is a round one, that is, a parenthesis.
es_es: Ahora, debe tener mucho cuidado de que el paréntesis externo debe ser eso: un paréntesis.

source: A special thanks to Damian Conway, who didn't only suggest important changes, but also took the time to count the number of listed features and make a Perl 6 version to show that Perl will stay Perl.
es_es: Debemos un agradecimiento especial a Damian Conway, quien no sólo sugirió importantes cambios, sino que también se entretuvo en contar el número de características incluidas y creó una versión para Perl 6 con el fin de demostrar que Perl seguirá siendo Perl.

source: Because Perl uses doubles (or long doubles, if configured) internally for all numeric calculation, converting from double into float and thence to double again loses precision, so C<unpack("f", pack("f", $foo)>) will not in general equal $foo.
es_es: Debido a Perl utiliza dobles (o dobles largos, si está configurado) internamente para todos cálculos numéricos, convirtiendo de doble en flotante y de allí a doble de nuevo, pierde precisión, por lo que C<unpack("f", pack("f", $foo)>) no será, generalmente, igual a $foo.

source: Any Array match against an array element[3] grep $a ~~ $_, @$b
es_es: Cualq. Array busca en un array elemento[3] grep $a ~~ $_, @$b

source: select($rout=$rin, $wout=$win, $eout=$ein, $timeout);
es_es: select($rout=$rin, $wout=$win, $eout=$ein, $tiempo_espera);

source: This could also be achieved by writing
es_es: Esto también puede lograrse escribiendo

source: You can get commercial support of Perl if you wish, although for most users the informal support will more than suffice.
es_es: Si lo desea, puede obtener soporte comercial para Perl, pero a la mayoría de los usuarios les bastará con el soporte informal.

source: We can create a module C<customre> to do this:
es_es: Podemos crear un módulo C<customre> para hacer esto:
